This is my tf output when doing terraform apply 

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # megaport_aws_connection.aws_vxc will be created
  + resource "megaport_aws_connection" "aws_vxc" {
      + admin_locked        = (known after apply)
      + aws_id              = (known after apply)
      + b_end               = (known after apply)
      + company_name        = (known after apply)
      + create_date         = (known after apply)
      + created_by          = (known after apply)
      + id                  = (known after apply)
      + live_date           = (known after apply)
      + locked              = (known after apply)
      + provisioning_status = (known after apply)
      + rate_limit          = 1000
      + vxc_internal_type   = "aws"
      + vxc_name            = "Terraform Example - AWS VXC"
      + vxc_type            = (known after apply)

      + a_end {
          + assigned_asn   = (known after apply)
          + assigned_vlan  = (known after apply)
          + location       = (known after apply)
          + name           = (known after apply)
          + owner_uid      = (known after apply)
          + port_id        = "380c747b-c647-4a27-93f9-65d13aada2d3"
          + requested_vlan = 191
        }

      + csp_settings {
          + amazon_account       = "11111111"
          + amazon_asn           = 64551
          + assigned_asn         = (known after apply)
          + hosted_connection    = true
          + requested_asn        = 64550
          + requested_product_id = "380c747b-c647-4a27-93f9-65d13aada2d3"
          + visibility           = "private"
        }
    }
```